Revit 2027 API
ParameterAccess.GetParameter Method
Overload List
Name | Description
GetParameter(ElementId, ElementId) |  Retrieves the parameter value for the parameter on the given element.
GetParameter(LinkElementId, Document, ElementId) |  Retrieves the parameter value for the parameter belonging to the parameter document on the given element.
Top
See Also
Reference
ParameterAccess Class
Autodesk.Revit.DB Namespace